---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Mechanical.DuctSizeSettings
source: html/c32219f2-4a33-846b-b41a-ab47dd6b8140.htm
---
# DuctSizeSettings Members

Inserts a new MEPSize in to the duct size settings. The duct shape determines the location of the new size in the size table.